SET NAMES UTF8;
DROP DATABASE IF EXISTS mz;
CREATE DATABASE mz CHARSET=UTF8;
USE mz;

/**家族分类**/
CREATE TABLE mz_family(
  fid INT PRIMARY KEY AUTO_INCREMENT,
  fname VARCHAR(32)
);
CREATE TABLE mz_phone_family(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  pname VARCHAR(32),
  p_in VARCHAR(128),          #备注
  price_s VARCHAR(128)        #起售价
);
CREATE TABLE mz_phone_family_pic(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  phone_id INT,               #手机编号
  pname VARCHAR(32),
  pbimg VARCHAR(128),         #大图片路径
  psimg VARCHAR(256)          #小图片路径
);

/**手机导航栏**/
CREATE TABLE mz_nav(
  nid INT PRIMARY KEY AUTO_INCREMENT,
  nphone VARCHAR(32),         #手机名称       
  nindex VARCHAR(32),         #首页
  nsur VARCHAR(32),           #概述
  npp VARCHAR(32),            #主标题
  npart VARCHAR(32)           #性能
); 

/**手机主页参数**/
CREATE TABLE mz_phone(
  lid INT PRIMARY KEY AUTO_INCREMENT,
  family_id INT,              #手机类编号
  phone_family_id INT,        #手机型号在手机中编号
  title VARCHAR(128),         #标题
  rem VARCHAR(128),           #备注
  price DECIMAL(10,2),        #价格
  sup VARCHAR(128),           #支持
  promise VARCHAR(64),        #服务承诺
  model VARCHAR(64),          #型号 
  net_type VARCHAR(64),       #网络类型
  spec VARCHAR(64),           #规格/颜色
  memory VARCHAR(32),         #内存容量
  choise VARCHAR(32),         #套餐选择
  sta VARCHAR(32),						#分期
  num VARCHAR(32),            #数量
  server_con VARCHAR(128)     #服务说明
);

/**手机图片**/
CREATE TABLE mz_phone_pic(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  phone_id INT,               #手机编号
  pname VARCHAR(32),					#手机名
  color VARCHAR(32),					#手机颜色
  sm VARCHAR(128),            #小图片路径
  lg VARCHAR(128)             #大图片路径
);

/**用户信息**/
CREATE TABLE mz_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16),

  avatar VARCHAR(128),        #头像图片路径
  user_name VARCHAR(32),      #用户名，如王小明
  gender INT                  #性别  0-女  1-男
);

/**收货地址信息**/
CREATE TABLE mz_receiver_address(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,                #用户编号
  receiver VARCHAR(16),       #接收人姓名
  province VARCHAR(16),       #省
  city VARCHAR(16),           #市
  county VARCHAR(16),         #县
  address VARCHAR(128),       #详细地址
  cellphone VARCHAR(16),      #手机
  fixedphone VARCHAR(16),     #固定电话
  postcode CHAR(6),           #邮编
  tag VARCHAR(16),            #标签名

  is_default BOOLEAN          #是否为当前用户的默认收货地址
);

/**购物车条目**/
CREATE TABLE mz_shoppingcart_item(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,      #用户编号
  product_id INT,   #商品编号
  count INT,        #购买数量
  is_checked BOOLEAN #是否已勾选，确定购买
);

/**用户订单**/
CREATE TABLE mz_order(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,
  address_id INT,
  status INT,             #订单状态  1-等待付款  2-等待发货  3-运输中  4-已签收  5-已取消
  order_time BIGINT,      #下单时间
  pay_time BIGINT,        #付款时间
  deliver_time BIGINT,    #发货时间
  received_time BIGINT    #签收时间
)AUTO_INCREMENT=10000000;

/**用户订单**/
CREATE TABLE mz_order_detail(
  did INT PRIMARY KEY AUTO_INCREMENT,
  order_id INT,           #订单编号
  product_id INT,         #产品编号
  count INT               #购买数量
);

/****首页轮播广告商品****/
CREATE TABLE mz_index_carousel(
  cid INT PRIMARY KEY AUTO_INCREMENT,
  img VARCHAR(128),
  title VARCHAR(64),
  href VARCHAR(128)
);

/****首页商品****/
CREATE TABLE mz_index_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(64),
  details VARCHAR(128),
  pic VARCHAR(128),
  price DECIMAL(10,2)
);

/******数据导入******/
/**家族分类**/
INSERT INTO mz_family VALUES
(1,'手机'),
(2,'手机配件');

/**手机分类**/
INSERT INTO mz_phone_family VALUES
(1,'魅族&nbsp;PRO&nbsp;7','双瞳如小窗&nbsp;佳景观历历','￥&nbsp;1299&nbsp;起'),
(2,'魅族&nbsp;PRO&nbsp;7&nbsp;Plus','双瞳如小窗&nbsp;佳景观历历','￥&nbsp;1799&nbsp;起'),
(3,'魅蓝&nbsp;Note6','NULL','￥&nbsp;799&nbsp;起'),
(4,'魅蓝&nbsp;6','NULL','￥&nbsp;799&nbsp;起'),
(5,'魅蓝&nbsp;6T','NULL','￥&nbsp;799&nbsp;起'),
(6,'魅蓝&nbsp;E3','骁龙636处理器 全系6G大运存','￥&nbsp;1799&nbsp;起'),
(7,'魅蓝&nbsp;S6','领券立减','￥&nbsp;999&nbsp;起'),
(8,'魅族&nbsp;M15','魅族15系列最高降501元，享魅族16系列优先购买权','￥&nbsp;1398&nbsp;起'),
(9,'魅族&nbsp;15','魅族15系列最高降501元，享魅族16系列优先购买权','￥&nbsp;1998&nbsp;起'),
(10,'魅族&nbsp;15&nbsp;Plus','魅族15系列最高降501元，享魅族16系列优先购买权','￥&nbsp;2498&nbsp;起'),
(11,'魅族&nbsp;16th','全款预订订单按付款时间先后发货','￥&nbsp;2698&nbsp;起'),
(12,'魅族&nbsp;16th&nbsp;Plus','全款预订订单按付款时间先后发货','￥&nbsp;3198&nbsp;起');
/**手机分类图片**/
INSERT INTO mz_phone_family_pic VALUES
(1,1,'魅族 PRO 7','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(2,1,'魅族 PRO 7','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(3,2,'魅族&nbsp;PRO&nbsp;7&nbsp;Plus','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(4,2,'魅族&nbsp;PRO&nbsp;7&nbsp;Plus','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(5,3,'&nbsp;Note6','../images/phone/ml/m1.jpg','../images/phone/ml/s1.jpg'),
(6,3,'&nbsp;Note6','../images/phone/ml/m2.jpg','../images/phone/ml/s2.jpg'),

(7,4,'魅蓝&nbsp;6','../images/phone/ml/m1.jpg','../images/phone/ml/s1.jpg'),
(8,4,'魅蓝&nbsp;6','../images/phone/ml/m2.jpg','../images/phone/ml/s2.jpg'),

(9,5,'魅蓝&nbsp;6T','../images/phone/ml/m1.jpg','../images/phone/ml/s1.jpg'),
(10,5,'魅蓝&nbsp;6T','../images/phone/ml/m2.jpg','../images/phone/ml/s2.jpg'),

(11,6,'魅蓝&nbsp;E3','../images/phone/ml/m1.jpg','../images/phone/ml/s1.jpg'),
(12,6,'魅蓝&nbsp;E3','../images/phone/ml/m2.jpg','../images/phone/ml/s2.jpg'),

(13,7,'魅蓝&nbsp;S6','../images/phone/ml/m1.jpg','../images/phone/ml/s1.jpg'),
(14,7,'魅蓝&nbsp;S6','../images/phone/ml/m2.jpg','../images/phone/ml/s2.jpg'),

(15,8,'魅族&nbsp;M15','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(16,8,'魅族&nbsp;M15','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(17,9,'魅族&nbsp;15','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(18,9,'魅族&nbsp;15','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(19,10,'魅族&nbsp;15&nbsp;Plus','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(20,10,'魅族&nbsp;15&nbsp;Plus','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(21,11,'魅族&nbsp;16th','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(22,11,'魅族&nbsp;16th','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg'),

(23,12,'魅族&nbsp;16th&nbsp;Plus','../images/phone/mz/m1.jpg','../images/phone/mz/s1.jpg'),
(24,12,'魅族&nbsp;16th&nbsp;Plus','../images/phone/mz/m2.jpg','../images/phone/mz/s2.jpg');

/**手机**/
INSERT INTO mz_phone VALUES
/**魅族 PRO 7，金银黑，4-64/4-128，标准，0和3期**/
(1,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','香槟金','4+64GB','1','3','50',NULL),
(2,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','静谧黑','4+64GB','1','3','50',NULL),
(3,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','提香银','4+64GB','1','3','50',NULL),
(4,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','香槟金','4+128GB','1','3','50',NULL),
(5,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','静谧黑','4+128GB','1','3','50',NULL),
(6,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','提香银','4+128GB','1','3','50',NULL),
(7,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','香槟金','4+64GB','1','0','50',NULL),
(8,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','静谧黑','4+64GB','1','0','50',NULL),
(9,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1299.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','提香银','4+64GB','1','0','50',NULL),
(10,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','香槟金','4+128GB','1','0','50',NULL),
(11,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','静谧黑','4+128GB','1','0','50',NULL),
(12,1,1,'魅族 PRO 7','双瞳如小窗 佳景观历历','1599.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7','全网通公开版','提香银','4+128GB','1','0','50',NULL),
/**魅族 PRO 7 Plus，金银黑，6-64/6-128，标准，0和3期**/
(13,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','香槟金','6+64GB','1','3','50',NULL),
(14,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','静谧黑','6+64GB','1','3','50',NULL),
(15,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','提香银','6+64GB','1','3','50',NULL),
(16,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','香槟金','6+128GB','1','3','50',NULL),
(17,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','静谧黑','6+128GB','1','3','50',NULL),
(18,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','提香银','6+128GB','1','3','50',NULL),
(19,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','香槟金','6+64GB','1','0','50',NULL),
(20,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','静谧黑','6+64GB','1','0','50',NULL),
(21,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1799.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','提香银','6+64GB','1','0','50',NULL),
(22,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','香槟金','6+128GB','1','0','50',NULL),
(23,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','静谧黑','6+128GB','1','0','50',NULL),
(24,1,2,'魅族 PRO 7 Plus','双瞳如小窗 佳景观历历','1999.00','<span>花呗分期</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 PRO 7 Plus','全网通公开版','提香银','6+128GB','1','0','50',NULL),
/**魅蓝 Note6，金银黑蓝，3-32/4-32，标准，0和3期**/
(25,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','提香银','3+32GB','1','0','50',NULL),
(26,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','曜石黑','3+32GB','1','0','50',NULL),
(27,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','香槟金','3+32GB','1','0','50',NULL),
(28,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','淡钴蓝','3+32GB','1','0','50',NULL),
(29,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','提香银','4+32GB','1','0','50',NULL),
(30,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','曜石黑','4+32GB','1','0','50',NULL),
(31,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','香槟金','4+32GB','1','0','50',NULL),
(32,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','淡钴蓝','4+32GB','1','0','50',NULL),
(33,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','提香银','3+32GB','1','3','50',NULL),
(34,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','曜石黑','3+32GB','1','3','50',NULL),
(35,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','香槟金','3+32GB','1','3','50',NULL),
(36,1,3,'魅蓝 Note6',NULL,'899.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','淡钴蓝','3+32GB','1','3','50',NULL),
(37,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','提香银','4+32GB','1','3','50',NULL),
(38,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','曜石黑','4+32GB','1','3','50',NULL),
(39,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','香槟金','4+32GB','1','3','50',NULL),
(40,1,3,'魅蓝 Note6',NULL,'1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 Note6','全网通公开版','淡钴蓝','4+32GB','1','3','50',NULL),
/**魅蓝 6，金银黑蓝，3-32/4-32，标准，0和3期**/
(41,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','提香银','2+16GB','1','3','50',NULL),
(42,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','曜石黑','2+16GB','1','3','50',NULL),
(43,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','香槟金','2+16GB','1','3','50',NULL),
(44,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','淡钴蓝','2+16GB','1','3','50',NULL),
(45,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','提香银','2+32GB','1','3','50',NULL),
(46,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','曜石黑','2+32GB','1','3','50',NULL),
(47,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','香槟金','2+32GB','1','3','50',NULL),
(48,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','淡钴蓝','2+32GB','1','3','50',NULL),
(49,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','提香银','2+16GB','1','0','50',NULL),
(50,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','曜石黑','2+16GB','1','0','50',NULL),
(51,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','香槟金','2+16GB','1','0','50',NULL),
(52,1,4,'魅蓝 6',NULL,'799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','淡钴蓝','2+16GB','1','0','50',NULL),
(53,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','提香银','2+32GB','1','0','50',NULL),
(54,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','曜石黑','2+32GB','1','0','50',NULL),
(55,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','香槟金','2+32GB','1','0','50',NULL),
(56,1,4,'魅蓝 6',NULL,'599.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6','全网通公开版','淡钴蓝','2+32GB','1','0','50',NULL),
/**魅蓝 6T，金黑蓝，4-32/4-64，标准/套餐1，0和3期**/
(57,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+32GB','1','3','50',NULL),
(58,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+32GB','1','3','50',NULL),
(59,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+32GB','1','3','50',NULL),
(60,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+32GB','2','3','50',NULL),
(61,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+32GB','2','3','50',NULL),
(62,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+32GB','2','3','50',NULL),
(63,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+64GB','1','3','50',NULL),
(64,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+64GB','1','3','50',NULL),
(65,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+64GB','1','3','50',NULL),
(66,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+64GB','2','3','50',NULL),
(67,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+64GB','2','3','50',NULL),
(68,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+64GB','2','3','50',NULL),
(69,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+32GB','1','0','50',NULL),
(70,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+32GB','1','0','50',NULL),
(71,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','999.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+32GB','1','0','50',NULL),
(72,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+32GB','2','0','50',NULL),
(73,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+32GB','2','0','50',NULL),
(74,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1037.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+32GB','2','0','50',NULL),
(75,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+64GB','1','0','50',NULL),
(76,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+64GB','1','0','50',NULL),
(77,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1099.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+64GB','1','0','50',NULL),
(78,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','曜石黑','4+64GB','2','0','50',NULL),
(79,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','香槟金','4+64GB','2','0','50',NULL),
(80,1,5,'魅蓝 6T','双摄全面屏，游戏长续航','1137.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 6T','全网通公开版','淡钴蓝','4+64GB','2','0','50',NULL),
/**魅蓝 E3，金黑，6-64，标准/套餐1，0和3期**/
(81,1,6,'魅蓝 E3','骁龙636处理器 全系6G大运存','1799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 E3','全网通公开版','香槟金','6+64GB','1','0','50',NULL),
(82,1,6,'魅蓝 E3','骁龙636处理器 全系6G大运存','1837.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 E3','全网通公开版','曜石黑','6+64GB','2','0','50',NULL),
(83,1,6,'魅蓝 E3','骁龙636处理器 全系6G大运存','1799.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 E3','全网通公开版','香槟金','6+64GB','1','3','50',NULL),
(84,1,6,'魅蓝 E3','骁龙636处理器 全系6G大运存','1837.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 E3','全网通公开版','曜石黑','6+64GB','2','3','50',NULL),
/**魅蓝 S6，蓝，3-64，标准，0和3期**/
(85,1,7,'魅蓝 S6','领券立减','1199.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 S6','全网通公开版','淡钴蓝','3+64GB','1','0','50',NULL),
(86,1,7,'魅蓝 S6','领券立减','1199.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅蓝 S6','全网通公开版','淡钴蓝','3+64GB','1','3','50',NULL),
/**魅族 M15，金黑蓝，6-64，标准/套餐1，0和3期**/
(87,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','曜石黑','4+64GB','1','3','50',NULL),
(88,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','香槟金','4+64GB','1','3','50',NULL),
(89,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','淡钴蓝','4+64GB','1','3','50',NULL),
(90,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','曜石黑','4+64GB','2','3','50',NULL),
(91,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','香槟金','4+64GB','2','3','50',NULL),
(92,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','淡钴蓝','4+64GB','2','3','50',NULL),
(93,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','曜石黑','4+64GB','1','0','50',NULL),
(94,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','香槟金','4+64GB','1','0','50',NULL),
(95,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1398.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','淡钴蓝','4+64GB','1','0','50',NULL),
(96,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','曜石黑','4+64GB','2','0','50',NULL),
(97,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','香槟金','4+64GB','2','0','50',NULL),
(98,1,8,'魅族 M15','魅族15系列最高降501元，享魅族16系列优先购买权','1436.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 M15','全网通公开版','淡钴蓝','4+64GB','2','0','50',NULL),
/**魅族 15 Plus，金黑白，6-64/6-128，标准/套餐1，0和3期**/
(99,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+64GB','1','3','50',NULL),
(100,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+64GB','1','3','50',NULL),
(101,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+64GB','1','3','50',NULL),
(102,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+64GB','2','3','50',NULL),
(103,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+64GB','2','3','50',NULL),
(104,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+64GB','2','3','50',NULL),
(105,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+128GB','1','3','50',NULL),
(106,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+128GB','1','3','50',NULL),
(107,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+128GB','1','3','50',NULL),
(108,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+128GB','2','3','50',NULL),
(109,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+128GB','2','3','50',NULL),
(110,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+128GB','2','3','50',NULL),
(111,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+64GB','1','0','50',NULL),
(112,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+64GB','1','0','50',NULL),
(113,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2498.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+64GB','1','0','50',NULL),
(114,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+64GB','2','0','50',NULL),
(115,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+64GB','2','0','50',NULL),
(116,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2556.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+64GB','2','0','50',NULL),
(117,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+128GB','1','0','50',NULL),
(118,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+128GB','1','0','50',NULL),
(119,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2798.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+128GB','1','0','50',NULL),
(120,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','曜石黑','6+128GB','2','0','50',NULL),
(121,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','香槟金','6+128GB','2','0','50',NULL),
(122,1,9,'魅族 15 Plus','魅族15系列最高降501元，享魅族16系列优先购买权','2856.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15 Plus','全网通公开版','白色','6+128GB','2','0','50',NULL),
/**魅族 15，金黑白，4-64/4-128，标准/套餐1，0和3期**/
(123,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+64GB','1','3','50',NULL),
(124,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+64GB','1','3','50',NULL),
(125,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+64GB','1','3','50',NULL),
(126,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+64GB','2','3','50',NULL),
(127,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+64GB','2','3','50',NULL),
(128,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+64GB','2','3','50',NULL),
(129,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+128GB','1','3','50',NULL),
(130,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+128GB','1','3','50',NULL),
(131,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+128GB','1','3','50',NULL),
(132,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+128GB','2','3','50',NULL),
(133,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+128GB','2','3','50',NULL),
(134,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+128GB','2','3','50',NULL),
(135,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+64GB','1','0','50',NULL),
(136,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+64GB','1','0','50',NULL),
(137,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','1998.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+64GB','1','0','50',NULL),
(138,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+64GB','2','0','50',NULL),
(139,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+64GB','2','0','50',NULL),
(140,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2036.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+64GB','2','0','50',NULL),
(141,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+128GB','1','0','50',NULL),
(142,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+128GB','1','0','50',NULL),
(143,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2298.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+128GB','1','0','50',NULL),
(144,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','曜石黑','4+128GB','2','0','50',NULL),
(145,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','香槟金','4+128GB','2','0','50',NULL),
(146,1,10,'魅族 15','魅族15系列最高降501元，享魅族16系列优先购买权','2356.00','<span>花呗分期</span><span>百城速达</span><span>顺丰发货</span><span>7天无理由退货</span>','本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 15','全网通公开版','白色','4+128GB','2','0','50',NULL),
/**魅族 16th，黑白，6-64/6-128，标准/套餐1，0**/
(147,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2698.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','静夜黑','6+64GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(148,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2998.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','静夜黑','6+128GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(149,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2827.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','静夜黑','6+64GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(150,1,11,'魅族 16th','全款预订订单按付款时间先后发货','3127.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','静夜黑','6+128GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(151,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2698.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','远山白','6+64GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(152,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2998.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','远山白','6+128GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(153,1,11,'魅族 16th','全款预订订单按付款时间先后发货','2827.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','远山白','6+64GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(154,1,11,'魅族 16th','全款预订订单按付款时间先后发货','3127.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th','全网通公开版','远山白','6+128GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
/**魅族 16th Plus，黑白，8-128/8-256，标准/套餐1，0**/
(155,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3498.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','静夜黑','8+128GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(156,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3998.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','静夜黑','8+256GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(157,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3667.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','静夜黑','8+128GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(158,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','4167.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','静夜黑','8+256GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(159,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3498.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','远山白','8+128GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(160,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3998.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','远山白','8+256GB','1','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(161,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','3667.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','远山白','8+128GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg'),
(162,1,12,'魅族 16th Plus','全款预订订单按付款时间先后发货','4167.00','<span>顺丰发货</span><span>7天无理由退货</span>','<a>预售商品</a>付款后预计42天内发货</br>本商品由&nbsp;魅族&nbsp;负责发货并提供售后服务','魅族 16th Plus','全网通公开版','远山白','8+256GB','2','0','50','../images/phone/mz-16th/index/mz-16-server.jpg');

/*详情页图片*/
INSERT INTO mz_phone_pic VALUES
/**魅族 PRO 7，金银黑，4-64/4-128，标准，0和3期**/
(1,1,'魅族PRO7','gold','../images/phone/mz/index/big/g1.jpg','../images/phone/mz/index/small/g1.jpg'),
(2,1,'魅族PRO7','gold','../images/phone/mz/index/big/g2.jpg','../images/phone/mz/index/small/g2.jpg'),
(3,1,'魅族PRO7','gold','../images/phone/mz/index/big/g3.jpg','../images/phone/mz/index/small/g3.jpg'),
(4,1,'魅族PRO7','gold','../images/phone/mz/index/big/g4.jpg','../images/phone/mz/index/small/g4.jpg'),
(5,1,'魅族PRO7','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(6,1,'魅族PRO7','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(7,1,'魅族PRO7','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(8,1,'魅族PRO7','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(9,1,'魅族PRO7','silver','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(10,1,'魅族PRO7','silver','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(11,1,'魅族PRO7','silver','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(12,1,'魅族PRO7','silver','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅族 PRO 7 Plus，金银黑，6-64/6-128，标准，0和3期**/
(13,2,'魅族 PRO 7 Plus','gold','../images/phone/mz/index/big/g1.jpg','../images/phone/mz/index/small/g1.jpg'),
(14,2,'魅族 PRO 7 Plus','gold','../images/phone/mz/index/big/g2.jpg','../images/phone/mz/index/small/g2.jpg'),
(15,2,'魅族 PRO 7 Plus','gold','../images/phone/mz/index/big/g3.jpg','../images/phone/mz/index/small/g3.jpg'),
(16,2,'魅族 PRO 7 Plus','gold','../images/phone/mz/index/big/g4.jpg','../images/phone/mz/index/small/g4.jpg'),
(17,2,'魅族 PRO 7 Plus','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(18,2,'魅族 PRO 7 Plus','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(19,2,'魅族 PRO 7 Plus','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(20,2,'魅族 PRO 7 Plus','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(21,2,'魅族 PRO 7 Plus','silver','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(22,2,'魅族 PRO 7 Plus','silver','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(23,2,'魅族 PRO 7 Plus','silver','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(24,2,'魅族 PRO 7 Plus','silver','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅蓝 Note6，金银黑蓝，3-32/4-32，标准，0和3期**/
(25,3,'魅蓝 Note6','gold','../images/phone/ml/index/big/g1.jpg','../images/phone/ml/index/small/g1.jpg'),
(26,3,'魅蓝 Note6','gold','../images/phone/ml/index/big/g2.jpg','../images/phone/ml/index/small/g2.jpg'),
(27,3,'魅蓝 Note6','gold','../images/phone/ml/index/big/g3.jpg','../images/phone/ml/index/small/g3.jpg'),
(28,3,'魅蓝 Note6','gold','../images/phone/ml/index/big/g4.jpg','../images/phone/ml/index/small/g4.jpg'),
(29,3,'魅蓝 Note6','black','../images/phone/ml/index/big/bk1.jpg','../images/phone/ml/index/small/bk1.jpg'),
(30,3,'魅蓝 Note6','black','../images/phone/ml/index/big/bk2.jpg','../images/phone/ml/index/small/bk2.jpg'),
(31,3,'魅蓝 Note6','black','../images/phone/ml/index/big/bk3.jpg','../images/phone/ml/index/small/bk3.jpg'),
(32,3,'魅蓝 Note6','black','../images/phone/ml/index/big/bk4.jpg','../images/phone/ml/index/small/bk4.jpg'),
(33,3,'魅蓝 Note6','silver','../images/phone/ml/index/big/s1.jpg','../images/phone/ml/index/small/s1.jpg'),
(34,3,'魅蓝 Note6','silver','../images/phone/ml/index/big/s2.jpg','../images/phone/ml/index/small/s2.jpg'),
(35,3,'魅蓝 Note6','silver','../images/phone/ml/index/big/s3.jpg','../images/phone/ml/index/small/s3.jpg'),
(36,3,'魅蓝 Note6','silver','../images/phone/ml/index/big/s4.jpg','../images/phone/ml/index/small/s4.jpg'),
(37,3,'魅蓝 Note6','blue','../images/phone/ml/index/big/bl1.jpg','../images/phone/ml/index/small/bl1.jpg'),
(38,3,'魅蓝 Note6','blue','../images/phone/ml/index/big/bl2.jpg','../images/phone/ml/index/small/bl2.jpg'),
(39,3,'魅蓝 Note6','blue','../images/phone/ml/index/big/bl3.jpg','../images/phone/ml/index/small/bl3.jpg'),
(40,3,'魅蓝 Note6','blue','../images/phone/ml/index/big/bl4.jpg','../images/phone/ml/index/small/bl4.jpg'),
/**魅蓝 6，金银黑蓝，3-32/4-32，标准，0和3期**/
(41,4,'魅蓝 6','gold','../images/phone/ml/index/big/g1.jpg','../images/phone/ml/index/small/g1.jpg'),
(42,4,'魅蓝 6','gold','../images/phone/ml/index/big/g2.jpg','../images/phone/ml/index/small/g2.jpg'),
(43,4,'魅蓝 6','gold','../images/phone/ml/index/big/g3.jpg','../images/phone/ml/index/small/g3.jpg'),
(44,4,'魅蓝 6','gold','../images/phone/ml/index/big/g4.jpg','../images/phone/ml/index/small/g4.jpg'),
(45,4,'魅蓝 6','black','../images/phone/ml/index/big/bk1.jpg','../images/phone/ml/index/small/bk1.jpg'),
(46,4,'魅蓝 6','black','../images/phone/ml/index/big/bk2.jpg','../images/phone/ml/index/small/bk2.jpg'),
(47,4,'魅蓝 6','black','../images/phone/ml/index/big/bk3.jpg','../images/phone/ml/index/small/bk3.jpg'),
(48,4,'魅蓝 6','black','../images/phone/ml/index/big/bk4.jpg','../images/phone/ml/index/small/bk4.jpg'),
(49,4,'魅蓝 6','silver','../images/phone/ml/index/big/s1.jpg','../images/phone/ml/index/small/s1.jpg'),
(50,4,'魅蓝 6','silver','../images/phone/ml/index/big/s2.jpg','../images/phone/ml/index/small/s2.jpg'),
(51,4,'魅蓝 6','silver','../images/phone/ml/index/big/s3.jpg','../images/phone/ml/index/small/s3.jpg'),
(52,4,'魅蓝 6','silver','../images/phone/ml/index/big/s4.jpg','../images/phone/ml/index/small/s4.jpg'),
(53,4,'魅蓝 6','blue','../images/phone/ml/index/big/bl1.jpg','../images/phone/ml/index/small/bl1.jpg'),
(54,4,'魅蓝 6','blue','../images/phone/ml/index/big/bl2.jpg','../images/phone/ml/index/small/bl2.jpg'),
(55,4,'魅蓝 6','blue','../images/phone/ml/index/big/bl3.jpg','../images/phone/ml/index/small/bl3.jpg'),
(56,4,'魅蓝 6','blue','../images/phone/ml/index/big/bl4.jpg','../images/phone/ml/index/small/bl4.jpg'),
/**魅蓝 6T，金黑蓝，4-32/4-64，标准/套餐1，0和3期**/
(57,1,'魅蓝 6T','gold','../images/phone/ml/index/big/g1.jpg','../images/phone/ml/index/small/g1.jpg'),
(58,5,'魅蓝 6T','gold','../images/phone/ml/index/big/g2.jpg','../images/phone/ml/index/small/g2.jpg'),
(59,5,'魅蓝 6T','gold','../images/phone/ml/index/big/g3.jpg','../images/phone/ml/index/small/g3.jpg'),
(60,5,'魅蓝 6T','gold','../images/phone/ml/index/big/g4.jpg','../images/phone/ml/index/small/g4.jpg'),
(61,5,'魅蓝 6T','black','../images/phone/ml/index/big/bk1.jpg','../images/phone/ml/index/small/bk1.jpg'),
(62,5,'魅蓝 6T','black','../images/phone/ml/index/big/bk2.jpg','../images/phone/ml/index/small/bk2.jpg'),
(63,5,'魅蓝 6T','black','../images/phone/ml/index/big/bk3.jpg','../images/phone/ml/index/small/bk3.jpg'),
(64,5,'魅蓝 6T','black','../images/phone/ml/index/big/bk4.jpg','../images/phone/ml/index/small/bk4.jpg'),
(65,5,'魅蓝 6T','blue','../images/phone/ml/index/big/bl1.jpg','../images/phone/ml/index/small/bl1.jpg'),
(66,5,'魅蓝 6T','blue','../images/phone/ml/index/big/bl2.jpg','../images/phone/ml/index/small/bl2.jpg'),
(67,5,'魅蓝 6T','blue','../images/phone/ml/index/big/bl3.jpg','../images/phone/ml/index/small/bl3.jpg'),
(68,5,'魅蓝 6T','blue','../images/phone/ml/index/big/bl4.jpg','../images/phone/ml/index/small/bl4.jpg'),
/**魅蓝 E3，金黑，6-64，标准/套餐1，0和3期**/
(69,6,'魅蓝 E3','gold','../images/phone/ml/index/big/g1.jpg','../images/phone/ml/index/small/g1.jpg'),
(70,6,'魅蓝 E3','gold','../images/phone/ml/index/big/g2.jpg','../images/phone/ml/index/small/g2.jpg'),
(71,6,'魅蓝 E3','gold','../images/phone/ml/index/big/g3.jpg','../images/phone/ml/index/small/g3.jpg'),
(72,6,'魅蓝 E3','gold','../images/phone/ml/index/big/g4.jpg','../images/phone/ml/index/small/g4.jpg'),
(73,6,'魅蓝 E3','black','../images/phone/ml/index/big/bk1.jpg','../images/phone/ml/index/small/bk1.jpg'),
(74,6,'魅蓝 E3','black','../images/phone/ml/index/big/bk2.jpg','../images/phone/ml/index/small/bk2.jpg'),
(75,6,'魅蓝 E3','black','../images/phone/ml/index/big/bk3.jpg','../images/phone/ml/index/small/bk3.jpg'),
(76,6,'魅蓝 E3','black','../images/phone/ml/index/big/bk4.jpg','../images/phone/ml/index/small/bk4.jpg'),
/**魅蓝 S6，蓝，3-64，标准，0和3期**/
(77,7,'魅蓝 S6','blue','../images/phone/ml/index/big/bl1.jpg','../images/phone/ml/index/small/bl1.jpg'),
(78,7,'魅蓝 S6','blue','../images/phone/ml/index/big/bl2.jpg','../images/phone/ml/index/small/bl2.jpg'),
(79,7,'魅蓝 S6','blue','../images/phone/ml/index/big/bl3.jpg','../images/phone/ml/index/small/bl3.jpg'),
(80,7,'魅蓝 S6','blue','../images/phone/ml/index/big/bl4.jpg','../images/phone/ml/index/small/bl4.jpg'),
/**魅族 M15，金黑蓝，6-64，标准/套餐1，0和3期**/
(81,8,'魅族 M15','gold','../images/phone/mz/index/big/g1.jpg','../images/phone/mz/index/small/g1.jpg'),
(82,8,'魅族 M15','gold','../images/phone/mz/index/big/g2.jpg','../images/phone/mz/index/small/g2.jpg'),
(83,8,'魅族 M15','gold','../images/phone/mz/index/big/g3.jpg','../images/phone/mz/index/small/g3.jpg'),
(84,8,'魅族 M15','gold','../images/phone/mz/index/big/g4.jpg','../images/phone/mz/index/small/g4.jpg'),
(85,8,'魅族 M15','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(86,8,'魅族 M15','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(87,8,'魅族 M15','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(88,8,'魅族 M15','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(89,8,'魅族 M15','white','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(90,8,'魅族 M15','white','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(91,8,'魅族 M15','white','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(92,8,'魅族 M15','white','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅族 15 Plus，金黑白，6-64/6-128，标准/套餐1，0和3期**/
(93,9,'魅族 15 Plus','gold','../images/phone/mz/index/big/g1.jpg','../images/phone/mz/index/small/g1.jpg'),
(94,9,'魅族 15 Plus','gold','../images/phone/mz/index/big/g2.jpg','../images/phone/mz/index/small/g2.jpg'),
(95,9,'魅族 15 Plus','gold','../images/phone/mz/index/big/g3.jpg','../images/phone/mz/index/small/g3.jpg'),
(96,9,'魅族 15 Plus','gold','../images/phone/mz/index/big/g4.jpg','../images/phone/mz/index/small/g4.jpg'),
(97,9,'魅族 15 Plus','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(98,9,'魅族 15 Plus','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(99,9,'魅族 15 Plus','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(100,9,'魅族 15 Plus','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(101,9,'魅族 15 Plus','white','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(102,9,'魅族 15 Plus','white','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(103,9,'魅族 15 Plus','white','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(104,9,'魅族 15 Plus','white','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅族 15，金黑白，4-64/4-128，标准/套餐1，0和3期**/
(105,10,'魅族 15','gold','../images/phone/mz/index/big/g1.jpg','../images/phone/mz/index/small/g1.jpg'),
(106,10,'魅族 15','gold','../images/phone/mz/index/big/g2.jpg','../images/phone/mz/index/small/g2.jpg'),
(107,10,'魅族 15','gold','../images/phone/mz/index/big/g3.jpg','../images/phone/mz/index/small/g3.jpg'),
(108,10,'魅族 15','gold','../images/phone/mz/index/big/g4.jpg','../images/phone/mz/index/small/g4.jpg'),
(109,10,'魅族 15','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(110,10,'魅族 15','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(111,10,'魅族 15','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(112,10,'魅族 15','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(113,10,'魅族 15','white','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(114,10,'魅族 15','white','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(115,10,'魅族 15','white','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(116,10,'魅族 15','white','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅族 16th，黑白，6-64/6-128，标准/套餐1，0**/
(117,11,'魅族 16th','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(118,11,'魅族 16th','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(119,11,'魅族 16th','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(120,11,'魅族 16th','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(121,11,'魅族 16th','white','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(122,11,'魅族 16th','white','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(123,11,'魅族 16th','white','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(124,11,'魅族 16th','white','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg'),
/**魅族 16th Plus，黑白，8-128/8-256，标准/套餐1，0**/
(125,12,'魅族 16th Plus','black','../images/phone/mz/index/big/bk1.jpg','../images/phone/mz/index/small/bk1.jpg'),
(126,12,'魅族 16th Plus','black','../images/phone/mz/index/big/bk2.jpg','../images/phone/mz/index/small/bk2.jpg'),
(127,12,'魅族 16th Plus','black','../images/phone/mz/index/big/bk3.jpg','../images/phone/mz/index/small/bk3.jpg'),
(128,12,'魅族 16th Plus','black','../images/phone/mz/index/big/bk4.jpg','../images/phone/mz/index/small/bk4.jpg'),
(129,12,'魅族 16th Plus','white','../images/phone/mz/index/big/wh1.jpg','../images/phone/mz/index/small/wh1.jpg'),
(130,12,'魅族 16th Plus','white','../images/phone/mz/index/big/wh2.jpg','../images/phone/mz/index/small/wh2.jpg'),
(131,12,'魅族 16th Plus','white','../images/phone/mz/index/big/wh3.jpg','../images/phone/mz/index/small/wh3.jpg'),
(132,12,'魅族 16th Plus','white','../images/phone/mz/index/big/wh4.jpg','../images/phone/mz/index/small/wh4.jpg');


